{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v3.2.0", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_4", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_15"}, "name": "input_15", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d_1071", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1071", "inbound_nodes": [[["input_15", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1072", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1072", "inbound_nodes": [[["conv2d_1071", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1073", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1073", "inbound_nodes": [[["conv2d_1072", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1074", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1074", "inbound_nodes": [[["conv2d_1073", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1075", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1075", "inbound_nodes": [[["conv2d_1074", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1076", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1076", "inbound_nodes": [[["conv2d_1075", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1000], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_14"}, "name": "input_14", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d_1077", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1077", "inbound_nodes": [[["conv2d_1076", 0, 0, {}]]]}, {"class_name": "RepeatVector", "config": {"name": "repeat_vector_4", "trainable": true, "dtype": "float32", "n": 1024}, "name": "repeat_vector_4", "inbound_nodes": [[["input_14", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1078", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1078", "inbound_nodes": [[["conv2d_1077", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_4", "trainable": true, "dtype": "float32", "target_shape": [32, 32, 1000]}, "name": "reshape_4", "inbound_nodes": [[["repeat_vector_4", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_4", "trainable": true, "dtype": "float32", "axis": 3}, "name": "concatenate_4", "inbound_nodes": [[["conv2d_1078", 0, 0, {}], ["reshape_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1079", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1079", "inbound_nodes": [[["concatenate_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1080", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1080", "inbound_nodes": [[["conv2d_1079", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_12", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "name": "up_sampling2d_12", "inbound_nodes": [[["conv2d_1080", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1081", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1081", "inbound_nodes": [[["up_sampling2d_12", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_13", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "name": "up_sampling2d_13", "inbound_nodes": [[["conv2d_1081", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1082", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1082", "inbound_nodes": [[["up_sampling2d_13", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1083", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1083", "inbound_nodes": [[["conv2d_1082", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1084", "trainable": true, "dtype": "float32", "filters": 2, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1084", "inbound_nodes": [[["conv2d_1083", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_14", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "name": "up_sampling2d_14", "inbound_nodes": [[["conv2d_1084", 0, 0, {}]]]}], "input_layers": [["input_15", 0, 0], ["input_14", 0, 0]], "output_layers": [["up_sampling2d_14", 0, 0]]}}, "training_config": {"loss": "mse", "metrics": null, "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "RMSprop", "config": {"name": "RMSprop", "learning_rate": 0.0010000000474974513, "decay": 0.0, "rho": 0.8999999761581421, "momentum": 0.0, "epsilon": 1e-07, "centered": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of7.bin", "group1-shard2of7.bin", "group1-shard3of7.bin", "group1-shard4of7.bin", "group1-shard5of7.bin", "group1-shard6of7.bin", "group1-shard7of7.bin"], "weights": [{"name": "conv2d_1071/kernel", "shape": [3, 3, 1, 64], "dtype": "float32"}, {"name": "conv2d_1071/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_1072/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv2d_1072/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_1073/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv2d_1073/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_1074/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "conv2d_1074/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_1075/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv2d_1075/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_1076/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}, {"name": "conv2d_1076/bias", "shape": [512], "dtype": "float32"}, {"name": "conv2d_1077/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "conv2d_1077/bias", "shape": [512], "dtype": "float32"}, {"name": "conv2d_1078/kernel", "shape": [3, 3, 512, 256], "dtype": "float32"}, {"name": "conv2d_1078/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_1079/kernel", "shape": [1, 1, 1256, 256], "dtype": "float32"}, {"name": "conv2d_1079/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_1080/kernel", "shape": [3, 3, 256, 128], "dtype": "float32"}, {"name": "conv2d_1080/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_1081/kernel", "shape": [3, 3, 128, 64], "dtype": "float32"}, {"name": "conv2d_1081/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_1082/kernel", "shape": [3, 3, 64, 32], "dtype": "float32"}, {"name": "conv2d_1082/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_1083/kernel", "shape": [3, 3, 32, 16], "dtype": "float32"}, {"name": "conv2d_1083/bias", "shape": [16], "dtype": "float32"}, {"name": "conv2d_1084/kernel", "shape": [3, 3, 16, 2], "dtype": "float32"}, {"name": "conv2d_1084/bias", "shape": [2], "dtype": "float32"}]}]}